madworm/IKEA-Samtid_mood-light_FW/arduino_setup/IDE-v-1.6/My_2µF_blog/avr/boards.txt
#
# https://github.com/arduino/Arduino/wiki/Arduino-Hardware-Cores-migration-guide-from-1.0-to-1.6
# https://github.com/arduino/Arduino/wiki/Arduino-IDE-1.5---3rd-party-Hardware-specification
#

##############################################################
#
# to activate this board, select it and use:
#
# 'Burn Bootloader' just once
# Make sure to select your programmer type in the menu!
# this makes sure the correct FUSE settings are used
#
isml.name=IKEA Samtid mood-light - ATmega168P / 16MHz Quartz / Optiboot 
[default]
isml.upload.protocol=arduino
isml.upload.maximum_size=15872
isml.upload.speed=115200
isml.upload.tool=arduino:avrdude
isml.bootloader.low_fuses=0xFF
isml.bootloader.high_fuses=0xDD
isml.bootloader.extended_fuses=0x04
isml.bootloader.file=optiboot/optiboot_atmega168p_16MHz.hex
isml.bootloader.unlock_bits=0x3F
isml.bootloader.lock_bits=0x0F
isml.bootloader.tool=arduino:avrdude
isml.build.mcu=atmega168p
isml.build.f_cpu=16000000L
isml.build.core=arduino:arduino
isml.build.variant=arduino:eightanaloginputs
isml.build.board=AVR_ISML
